InformationRegisters/ИсполнителиПоДенежнымСредствамСобственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамСобственные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.ВводДенежныхСредств</xr:Item>
				<xr:Item>Document.РасчетНДФЛ</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиентскомуОтноситьНаДатуОплаты</Name>
					<Comment>По клиентскому учету относить на дату оплаты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогИлиВзнос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиИВзносы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачестьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоОбщимРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предварительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Арендатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураСводный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Займы</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВладельцаДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияВознаграждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокументаДляПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ПодборЗадолженностиПоДенежнымСредствам/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьНовуюНастройкуОтбораНаСервере(ИмяПоля, ПредставлениеПоля, ТипЗначенияПоля, ЗначениеПоУмолчанию = Неопределено)
	
	НоваяСтрокаНастройкиОтбора = ЭтаФорма.НастройкиОтбора.Добавить();
	НоваяСтрокаНастройкиОтбора.ИмяПоля           = ИмяПоля;
	НоваяСтрокаНастройкиОтбора.ПредставлениеПоля = ?(ЗначениеЗаполнено(ПредставлениеПоля), ПредставлениеПоля, ИмяПоля);
	НоваяСтрокаНастройкиОтбора.ТипЗначенияПоля   = ТипЗначенияПоля;
	
	// т.к. не известно было ли это поле передано в параметрах,
	// воспользуемся хитрым универсальным способом получения значения
	Если ЭтаФорма.Параметры.Свойство(ИмяПоля) Тогда
		НоваяСтрокаНастройкиОтбора.ЗначениеПоля  = ЭтаФорма.Параметры[ИмяПоля];
		НоваяСтрокаНастройкиОтбора.Фиксированный = Истина;
		НоваяСтрокаНастройкиОтбора.Используется  = Истина;
		
		// скроем одноименную колонку для фиксированных значений
		Если Элементы.Найти("ОстаткиЗадолженности" + ИмяПоля) <> Неопределено Тогда
			Элементы["ОстаткиЗадолженности" + ИмяПоля].Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьНовуюНастройкуОтбораНаСервере

&НаСервере
Процедура ЗаполнитьНастройкиОтборовНаСервере()
	
	// закладываемся, что период - обязательный параметр
	ДобавитьНовуюНастройкуОтбораНаСервере("Период",, Новый ОписаниеТипов("Дата"), ТекущаяДатаСеанса());
	
	// Расчетный счет тоже добавляем, т. к. он отсутствует в регистре ЗадолженностиПоДенежнымСредствам
	ДобавитьНовуюНастройкуОтбораНаСервере("РасчетныйСчет",, Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	
	// прочие поля отбора подтянем из измерений регистра
	Для каждого Измерение Из Метаданные.РегистрыНакопления.ЗадолженностиПоДенежнымСредствам.Измерения Цикл
		ДобавитьНовуюНастройкуОтбораНаСервере(Измерение.Имя, Измерение.Синоним, Новый ОписаниеТипов(Измерение.Тип));
	КонецЦикла;
	
	// упорядочим полученную таблицу
	ЭтаФорма.НастройкиОтбора.Сортировать("Фиксированный УБЫВ, ИмяПоля");
	
КонецПроцедуры // ЗаполнитьНастройкиОтборовНаСервере

&НаСервере
Процедура ЗаполнитьОстаткиЗадолженностиНаСервере()

	Запрос = Новый Запрос;

	// По умолчанию проверяем текущую дату
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	// соберем условия отбора
	УсловияОтбора = ", ";
	УсловияОтбораРС = ", ";
	
	Для Каждого СтрокаНастройкиОтбора Из ЭтаФорма.НастройкиОтбора Цикл
		
		Если СтрокаНастройкиОтбора.ИмяПоля = "РасчетныйСчет" Тогда
			Запрос.УстановитьПараметр("РасчетныйСчетНеУказан",  Не СтрокаНастройкиОтбора.Используется);
			Запрос.УстановитьПараметр("РасчетныйСчет",  		СтрокаНастройкиОтбора.ЗначениеПоля);
		КонецЕсли;
		
		Если Не СтрокаНастройкиОтбора.Используется Тогда
			Продолжить;
		КонецЕсли;
			
		Если СтрокаНастройкиОтбора.ИмяПоля = "Период" Тогда
			Если ЗначениеЗаполнено(СтрокаНастройкиОтбора.ЗначениеПоля) Тогда // если не передано или не заполнено, то остатки выбираются на точку актуальности
				УсловияОтбора = "&Период" + УсловияОтбора;
				УсловияОтбораРС = "&Период" + УсловияОтбораРС;
				Запрос.УстановитьПараметр(СтрокаНастройкиОтбора.ИмяПоля, Новый Граница(СтрокаНастройкиОтбора.ЗначениеПоля, ВидГраницы.Включая));
				Если ТипЗнч(СтрокаНастройкиОтбора.ЗначениеПоля) = Тип("Дата") Тогда
					Запрос.УстановитьПараметр("Дата", СтрокаНастройкиОтбора.ЗначениеПоля);
				Иначе	
					Запрос.УстановитьПараметр("Дата", СтрокаНастройкиОтбора.ЗначениеПоля.Дата);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаНастройкиОтбора.ИмяПоля = "Основание" И ТипЗнч(СтрокаНастройкиОтбора.ЗначениеПоля) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
			УсловияОтбора = УсловияОтбора + ?(Прав(УсловияОтбора, 2) = ", ", "", " И ") + 
			"Основание В
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ЗадолженностиПоДенежнымСредствам.Основание
			|	ИЗ
			|		РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|	ГДЕ
			|		ЗадолженностиПоДенежнымСредствам.Регистратор = &Основание) И 
			|	(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода) ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)) ";
			Запрос.УстановитьПараметр(СтрокаНастройкиОтбора.ИмяПоля, СтрокаНастройкиОтбора.ЗначениеПоля);
			
		ИначеЕсли СтрокаНастройкиОтбора.ИмяПоля = "РасчетныйСчет" Тогда
			// Параметр обработан ранее
			Продолжить;	
		Иначе
			УсловияОтбора = УсловияОтбора + ?(Прав(УсловияОтбора, 2) = ", ", "", " И ") + СтрокаНастройкиОтбора.ИмяПоля + " = &" + СтрокаНастройкиОтбора.ИмяПоля;
			Запрос.УстановитьПараметр(СтрокаНастройкиОтбора.ИмяПоля, СтрокаНастройкиОтбора.ЗначениеПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОстатки.Основание) = ТИП(Документ.НачислениеЗадолженности)
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).ДоговорАренды <> ЗНАЧЕНИЕ(Справочник.Договоры.)
		|							ТОГДА ВЫБОР
		|									КОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).ДоговорАренды.Контрагент = ЗадолженностиПоДенежнымСредствамОстатки.Контрагент
		|										ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).ДоговорАренды
		|									ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).Договор
		|								КОНЕЦ
		|						ИНАЧЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).Договор
		|					КОНЕЦ
		|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Основание.Договор
		|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.Договоры.)) КАК Договор,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупона,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаВсего,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата КАК ОснованиеДата,
		|	ЕСТЬNULL(ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)) КАК РасчетныйСчет
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&Период, ) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО (ВЫБОР
		|				КОГДА &РасчетныйСчетНеУказан
		|						ИЛИ &РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Организация = ИсполнителиПоДенежнымСредствамСобственные.Организация
		|						И ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|						И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|							ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &Дата)
		|						И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОснованиеДата";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период, ", УсловияОтбора);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодРС,", УсловияОтбораРС);
	
	ЭтаФорма.ОстаткиЗадолженности.Загрузить(Запрос.Выполнить().Выгрузить());
			
КонецПроцедуры // ЗаполнитьОстаткиЗадолженностиНаСервере

&НаСервере
Функция ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере(НомерСтроки = Неопределено)
	
	Если НомерСтроки <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(ЭтаФорма.ОстаткиЗадолженности[НомерСтроки]);
	Иначе
		Строки = ЭтаФорма.ОстаткиЗадолженности.НайтиСтроки(Новый Структура("Флажок", Истина));
	КонецЕсли;
	
	Если Строки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		ВидЗадолженности = Строки[0].ВидЗадолженности;
		Для каждого Строка ИЗ Строки Цикл
			Если Строка.ВидЗадолженности<>ВидЗадолженности Тогда
				Сообщить("Вид задолженности должен быть одинаковым!");
				Возврат  Неопределено;
			КонецЕсли;
		КонецЦикла;
		Возврат
			Новый ХранилищеЗначения(ЭтаФорма.ОстаткиЗадолженности.Выгрузить(Строки));
	КонецЕсли;
	
КонецФункции // ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере

#Область СОБЫТИЯ_ФОРМЫ_И_ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройкиОтборовНаСервере();
	
	ЗаполнитьОстаткиЗадолженностиНаСервере();
	
	Если ЭтаФорма.Параметры.Свойство("ТекущиеДанные") Тогда
		РаботаСФормамиКлиентСервер.УстановитьТекущуюСтрокуТаблицы(ЭтаФорма, "ОстаткиЗадолженности", ЭтаФорма.Параметры.ТекущиеДанные);
	КонецЕсли;
	
	Если ЭтаФорма.ОстаткиЗадолженности.Количество() = 0 И ЭтаФорма.Параметры.ЗакрыватьПустой Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.НастройкиОтбора.Видимость = Элементы.ФормаКомандаПоказатьСкрытьНастройкиОтбора.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиОтбора.ТекущиеДанные;
	
	// ограничим тип данных
	Элементы.НастройкиОтбораЗначениеПоля.ОграничениеТипа = ТекущиеДанные.ТипЗначенияПоля;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.НастройкиОтбора.ТекущиеДанные;
	
	Отказ = ТекущиеДанные.Фиксированный;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораИспользуетсяПриИзменении(Элемент)
	
	ЗаполнитьОстаткиЗадолженностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораЗначениеПоляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиОтбора.ТекущиеДанные;
	ТекущиеДанные.Используется = ЗначениеЗаполнено(ТекущиеДанные.ЗначениеПоля); // будем считать, что если значение очистили, то отбор по нему видеть не хотят и наоборот
	
	ЗаполнитьОстаткиЗадолженностиНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаПеренестиВДокумент(Команда)
	
	ТекущиеОстаткиЗадолженности = Элементы.ОстаткиЗадолженности.ТекущиеДанные;
	
	Если ТекущиеОстаткиЗадолженности <> Неопределено И Не ЭтаФорма.Параметры.МножественныйВыбор Тогда
		ТекущиеОстаткиЗадолженности.Флажок = Истина;
	КонецЕсли;
	
	Хранилище = ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере();
	
	Если ЗначениеЗаполнено(Хранилище) Тогда
		ЭтаФорма.Закрыть(Хранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ЗаполнитьОстаткиЗадолженностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для каждого СтрокаОстаткиЗадолженности Из ЭтаФорма.ОстаткиЗадолженности Цикл
		СтрокаОстаткиЗадолженности.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для каждого СтрокаОстаткиЗадолженности Из ЭтаФорма.ОстаткиЗадолженности Цикл
		СтрокаОстаткиЗадолженности.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЗадолженностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть(ПолучитьХранилищеВыбранныхОстатковЗадолженностиНаСервере(ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьНастройкиОтбора(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьНастройкиОтбора.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьНастройкиОтбора.Пометка;
	
	Элементы.НастройкиОтбора.Видимость = Элементы.ФормаКомандаПоказатьСкрытьНастройкиОтбора.Пометка;
	
КонецПроцедуры
